app/controllers/articles_controller.rb

  def update
    @article = Article.find(params[:id])
    @article.title = params[:article][:title]
    @article.description = params[:article][:description]
    @article.save
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "My edit"], ["description", "My article description"], ["updated_at", "2019-10-23 03:06:18.129897"], ["id", 1]]